app/controllers/users_controller.rb

SELECT count(*) AS count_all FROM "users"
INSERT INTO "users" ("admin_level", "last_request_at", "created_at", "crypted_password", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES(0, '2009-06-15 09:14:20.354062', '2009-06-15 09:14:20.354636', E'4ac6d12bf6ea2a0c0045c3fe3e463cc56409ec0aa8d57e3fd564f6f7094850aeef4141e37e376d20a5d64998424844f7d61d2b55891d979e8fa2e3cf1239191c', '2009-06-15 09:14:20.354636', 0, E'127.0.0.1', E'7BImnd44biQdyJX7MCSS', '2009-06-15 09:14:20.329964', E'3192888a91854151dccdb7c65fc4c985415ef651a6b750781696ffa439b4b5fe6dec7a43568602353b2af5f636ce4d45ca4bec93eec0dce22bc8984d74d027a9', 1, NULL, NULL, E'jordan.d.carter@gmail.com') RETURNING "id"
---
  def create
    @user = User.new(params[:user])

    @user.set_admin(User.count == 0)  #first person signed up is an admin

    if @user.save