app/controllers/websites_controller.rb

SELECT * FROM "websites"
---
  def index
    @websites = Website.all(:include => :counts)

SELECT * FROM "websites" WHERE ("websites"."id" = 2)
---
  def show
    @website = Website.find(params[:id])

INSERT INTO "user_websites" ("created_at", "website_id", "updated_at", "user_id") VALUES('2009-06-15 10:46:00.045981', 2, '2009-06-15 10:46:00.045981', 7) RETURNING "id"
INSERT INTO "websites" ("created_at", "updated_at", "url") VALUES('2009-06-15 10:46:00.034309', '2009-06-15 10:46:00.034309', E'www.madefromnewzealand.com') RETURNING "id"
SELECT * FROM "websites" WHERE ("websites"."url" = E'www.madefromnewzealand.com') LIMIT 1
---
  def create
    @website = Website.find_or_create_by_url(params[:website][:url])